cases/05_navier_stokes_equation/31_triangular_cavity_piso_Re500_hybrid80/N80/constant/Ccz
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "constant";
    object      Ccz;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
7308
(
0.05
0.05
0.05
0.05
0.05
0.05
0.05
0.05
...
)
;

boundaryField
{
    movingTop
    {
        type            calculated;
        value           nonuniform List<scalar> 8(0.05 0.05 0.05 0.05 0.05 0.05 0.05 0.05);
    }
    rightWall
    {
        type            calculated;
        value           nonuniform List<scalar> 8(0.05 0.05 0.05 0.05 0.05 0.05 0.05 0.05);
    }
    leftWall
    {
        type            calculated;
        value           nonuniform List<scalar> 8(0.05 0.05 0.05 0.05 0.05 0.05 0.05 0.05);
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}


// ************************************************************************* //
